Tutorial 1: Basic of Single & Multi-Table SQL
======================

Some parts of this notebook are adapted from material by Theodoros Rekatsinas (Apple)

In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:postgres@db:5432/postgres

Let's create a table, stuff it with data, and query it!

In [6]:
%%sql drop table if exists product cascade;
create table product(
       pname        varchar primary key, -- name of the product
       price        decimal(10,2),               -- price of the product
       category     varchar,             -- category
       manufacturer varchar NOT NULL     -- manufacturer
);
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * postgresql://postgres:***@db:5432/postgres
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Let's look at the products..

In [7]:
%sql select * from product;

 * postgresql://postgres:***@db:5432/postgres
4 rows affected.

[('Gizmo', Decimal('19.99'), 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', Decimal('29.99'), 'Gadgets', 'GizmoWorks'),
 ('SingleTouch', Decimal('149.99'), 'Photography', 'Canon'),
 ('MultiTouch', Decimal('203.99'), 'Household', 'Hitachi')]

Some *terminology* for SQL.
--------------------------
* The _name_ of the table is product.
* Each row of the table is called a _row_ or a _tuple_. 
* Notice all tuples have the fields or _attributes_.
* The number of rows is called the _cardinality_ while the number of attributes is called the _arity_

Schema Conventions
-----------------
* The schema of product is written as follows:

> product(<u>pname</u>, price, category, manufacturer)

Underlining a set of attributes indicates that they form a _key_.

* In this case, pname is a key. If the product name was only unique for a given manufacturer, we'd write:

> product(<u>pname</u>, price, category, <u>manufacturer</u>)

Tables Explained
----------------
* A tuple = a record
  * Restriction: all attributes are of atomic type
  * There are many atomic data types in SQL engines, look [here](http://www.postgresql.org/docs/9.4/static/datatype.html) for example.


* A table = a (multi)-set of tuples
  * A multiset is like a list…
  * ... but a mutiset is unordered: 
    * no first(), no next(), no last().

# Outline
* Create a database -- done!

* Simple querying -- now!

* Queries with more than one relation -- next!

# Let the (Simple) querying begin! 
* We'll introduce the basics of SQL by example.
* There are many good SQL tutorials on the web, this is intended to get you started.

> SELECT (attributes)<br>
> FROM (one or more tables)<br>
> WHERE (conditions)

This is the simple SELECT-FROM-WHERE (SFW) block. Let's see some examples!

In [8]:
%%sql
SELECT * from Product 
WHERE category='Gadgets' and price > 20.0;

 * postgresql://postgres:***@db:5432/postgres
1 rows affected.

[('PowerGizmo', Decimal('29.99'), 'Gadgets', 'GizmoWorks')]

Let's give an example of *projection*, i.e., we only retain some attributes from the query.

In [9]:
%%sql 
SELECT Pname, Price, Manufacturer
FROM Product;

 * postgresql://postgres:***@db:5432/postgres
4 rows affected.

[('Gizmo', Decimal('19.99'), 'GizmoWorks'),
 ('PowerGizmo', Decimal('29.99'), 'GizmoWorks'),
 ('SingleTouch', Decimal('149.99'), 'Canon'),
 ('MultiTouch', Decimal('203.99'), 'Hitachi')]

* The output is *still* a table, and its schema is 
> Answer(pname, price, manufacturer)

* Of course, we can combine selection and projection.

In [10]:
%%sql
SELECT Pname, Price, Manufacturer
FROM Product
WHERE category='Gadgets';

 * postgresql://postgres:***@db:5432/postgres
2 rows affected.

[('Gizmo', Decimal('19.99'), 'GizmoWorks'),
 ('PowerGizmo', Decimal('29.99'), 'GizmoWorks')]

The output of a query on a table is again a table 
----------------------------------------------
* This is because the query language is *compositional*
* The output of a query really is a table!
* look at this crazy query, what does it ask for?

In [11]:
%%sql
SELECT * FROM Product;

SELECT
    p.manufacturer, p.pname, p.price
FROM 
    (SELECT distinct p0.Manufacturer
     FROM Product p0
     WHERE p0.price < 20.00) cp, -- this is a nested query!
    Product p
WHERE 
    p.manufacturer = cp.manufacturer and p.price::numeric > 20.00

 * postgresql://postgres:***@db:5432/postgres
4 rows affected.
1 rows affected.

[('GizmoWorks', 'PowerGizmo', Decimal('29.99'))]

Details on SQL
--------------

* Some elements are case insensitive (think: program):
  * Same: SELECT  Select  select
  * Same: Product   product
  * Different: ‘Seattle’  ‘seattle’
  

* Constants (single quotes)
  * ‘abc’  - yes
  * “abc” - no

LIKE
====

The LIKE operator is to search strings, perhaps with wildcards. Format is:
    
> SELECT *
> FROM Products
> WHERE pname like '%gizmo%'

* % matches any number of characters
* \_ matches one character
* The like operator is case sensitive

In [12]:
%%sql
SELECT *  FROM product
where pname LIKE '%Gizmo%'

 * postgresql://postgres:***@db:5432/postgres
2 rows affected.

[('Gizmo', Decimal('19.99'), 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', Decimal('29.99'), 'Gadgets', 'GizmoWorks')]

Eliminating Duplicates
---------------------
* duplicates can sometimes be unwelcome or suprising. 
  * Recall tables are _multisets_!

In [13]:
%sql SELECT category from product;

 * postgresql://postgres:***@db:5432/postgres
4 rows affected.

[('Gadgets',), ('Gadgets',), ('Photography',), ('Household',)]

In [14]:
%%sql 
-- easy to remove duplicates, use the distinct keyword
SELECT DISTINCT category from product;

 * postgresql://postgres:***@db:5432/postgres
3 rows affected.

[('Gadgets',), ('Photography',), ('Household',)]

Ordering the results
---------------------
* Sometimes you want the results ordered, let's see some examples!

In [16]:
%%sql
-- sometimes we want to order the results.
-- order by is ascending by default!
SELECT   pname, price, manufacturer
FROM     Product
WHERE    price > 50
ORDER BY  price, pname

 * postgresql://postgres:***@db:5432/postgres
2 rows affected.

[('SingleTouch', Decimal('149.99'), 'Canon'),
 ('MultiTouch', Decimal('203.99'), 'Hitachi')]

In [17]:
%%sql
-- sometimes we want to order the results.
-- can order like so, each component individually
SELECT   price, manufacturer
FROM     Product
-- the order is "dictionary order" in the clause.
ORDER BY   manufacturer ASC, price DESC

 * postgresql://postgres:***@db:5432/postgres
4 rows affected.

[(Decimal('149.99'), 'Canon'),
 (Decimal('29.99'), 'GizmoWorks'),
 (Decimal('19.99'), 'GizmoWorks'),
 (Decimal('203.99'), 'Hitachi')]

Joins!
------
Let's illustrate some more complex queries that join two tables together.

* Consider a table of companies, stock price, and HQ country.
> company(<u>cname</u>, stockprice, country)
 
* we'll then revist products and introduce some consistency requirements

In [18]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('GizmoWorks', 25.0, 'USA');
insert into company values ('Canon', 65.0, 'Japan');
insert into company values ('Hitachi', 15.0, 'Japan');

 * postgresql://postgres:***@db:5432/postgres
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%sql select * from company;

 * postgresql://postgres:***@db:5432/postgres
3 rows affected.

[('GizmoWorks', '$25.00', 'USA'),
 ('Canon', '$65.00', 'Japan'),
 ('Hitachi', '$15.00', 'Japan')]

Foreign Key Constraints
-----------------------
* Suppose that we want to create a products table

> Product(pname, price, category, manufacturer)

* Something is odd here: We can have manufacturers that sell products but don't occur in our company table!
* To protect against, this we introduce _foreign keys_

We say the company name in products _refers_ to cname in company. Let's do it in SQL! the key statement below is:

> foreign key (manufacturer) references company(cname)

  * Note that cname must be a key in company! 
  * Keys and Foreign keys come up _all_ the time. 
    * PKs and FKs are common (others, less so)

In [21]:
%%sql drop table if exists product;

CREATE TABLE product (
    pname varchar PRIMARY KEY, -- name of the product
    price decimal(10,2), -- price of the product
    category varchar, -- category
    manufacturer varchar REFERENCES company(cname) -- foreign key reference
);
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * postgresql://postgres:***@db:5432/postgres
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Indeed foreign keys are a _constraint_ 
> What happens if we introduce a company name not in our table?

In [22]:
try:
    %sql insert into product values('MultiTouch', 203.99, 'Household', 'Google');
except Exception as e:
    print(e.orig.pgcode)  # print PostgreSQL error code
    print(e.orig.pgerror)  # print PostgreSQL error message
    print("Rejected!")

 * postgresql://postgres:***@db:5432/postgres
(psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "product_pkey"
DETAIL:  Key (pname)=(MultiTouch) already exists.

[SQL: insert into product values('MultiTouch', 203.99, 'Household' , 'Google' );]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [23]:
%%sql
-- the update is rejected!
select * from product;

 * postgresql://postgres:***@db:5432/postgres
4 rows affected.

[('Gizmo', Decimal('19.99'), 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', Decimal('29.99'), 'Gadgets', 'GizmoWorks'),
 ('SingleTouch', Decimal('149.99'), 'Photography', 'Canon'),
 ('MultiTouch', Decimal('203.99'), 'Household', 'Hitachi')]

Foreign Keys and Delete
=============

* What happens if we delete a company? Three options:
  * Disallow the delete. (default)
  * Remove all products (add "`on delete cascade`")
  * A third variant due to NULL

**First option (default)- delete is disallowed**

In [24]:
try:
    %sql delete from company where cname = 'Hitachi';
except Exception as e:
    print (e)
    print ("Disallowed!")

 * postgresql://postgres:***@db:5432/postgres
(psycopg2.errors.ForeignKeyViolation) update or delete on table "company" violates foreign key constraint "product_manufacturer_fkey" on table "product"
DETAIL:  Key (cname)=(Hitachi) is still referenced from table "product".

[SQL: delete from company where cname = 'Hitachi' ;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

**Second option: remove all products belonging to the company we delete**

Try adjusting the foreign key constraint clause when you create the products table as follows:
> foreign key (manufacturer) references company(cname) on delete cascade

Now, when a company row is deleted, all of the products linked by the foreign key constraint will be deleted as well.

Joins!
------
> Product (<u>pname</u>,  price, category, manufacturer)<br>
> Company (<u>cname</u>, stockPrice, country)

The query we want to answer is:

> Find all products under $200 manufactured in Japan;
> return their names and prices. 

Notice products don't have a location and manufacturers don't have price. Need info in _each_ of the tables.

In [25]:
%%sql
SELECT pname, price
FROM product, company
where manufacturer=cname and country='Japan' and price <= 200;

 * postgresql://postgres:***@db:5432/postgres
1 rows affected.

[('SingleTouch', Decimal('149.99'))]

Let's see how to write this join in a modular way.

In [26]:
%%sql -- Part 1: Set of Japanese companies.
SELECT distinct cname -- do we need distinct?
from company where country='Japan';

 * postgresql://postgres:***@db:5432/postgres
2 rows affected.

[('Canon',), ('Hitachi',)]

In [27]:
%%sql -- Part 2: Cheap Products (under $200)
select distinct pname, price, manufacturer
from product
where price::numeric <= 200;

 * postgresql://postgres:***@db:5432/postgres
3 rows affected.

[('PowerGizmo', Decimal('29.99'), 'GizmoWorks'),
 ('SingleTouch', Decimal('149.99'), 'Canon'),
 ('Gizmo', Decimal('19.99'), 'GizmoWorks')]

In [28]:
%%sql -- combine them with nested SFW queries... this is a cross product?
SELECT * 
FROM 
  (SELECT DISTINCT pname, price, manufacturer
   FROM product
   WHERE price::numeric <= 200) CheapProducts,
  (SELECT DISTINCT cname
   FROM company
   WHERE country='Japan') JapaneseProducts;

 * postgresql://postgres:***@db:5432/postgres
6 rows affected.

[('PowerGizmo', Decimal('29.99'), 'GizmoWorks', 'Canon'),
 ('PowerGizmo', Decimal('29.99'), 'GizmoWorks', 'Hitachi'),
 ('SingleTouch', Decimal('149.99'), 'Canon', 'Canon'),
 ('SingleTouch', Decimal('149.99'), 'Canon', 'Hitachi'),
 ('Gizmo', Decimal('19.99'), 'GizmoWorks', 'Canon'),
 ('Gizmo', Decimal('19.99'), 'GizmoWorks', 'Hitachi')]

In [29]:
%%sql
-- Combine them as a join!
SELECT DISTINCT pname, price
FROM 
  (SELECT DISTINCT pname, price, manufacturer
   FROM product
   WHERE price::numeric <= 200) CheapProducts,
  (SELECT distinct cname
   FROM company
   WHERE country='Japan') JapaneseProducts
WHERE cname = manufacturer;

 * postgresql://postgres:***@db:5432/postgres
1 rows affected.

[('SingleTouch', Decimal('149.99'))]

Duplicate answers from join
--------------------------

Note that we can get duplicate answers from a join... To eliminates duplicates, we use the DISTINCT keyword after SELECT

In [31]:
%%sql -- duplicate answer
SELECT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';

 * postgresql://postgres:***@db:5432/postgres
2 rows affected.

[('USA',), ('USA',)]

In [32]:
%%sql -- duplicate-free answer
SELECT DISTINCT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';

 * postgresql://postgres:***@db:5432/postgres
1 rows affected.

[('USA',)]

SQL Takeways
--------
* There are potentially _many logically equivalent ways_ to write a query
    * This fact will be used later by the query optimizer and in homework!
    * On exams, write the simplest thing (break it down in parts?)

Tutorial 2: Pandas walkthrough
-----

### Load the Dataset

Use Pandas to read the CSV file 'IMDB-movies.csv'

In [37]:
import pandas as pd
df = pd.read_csv('/tmp/IMDB-movies.csv')

### Exploring the Data
To get a quick look at the data, we used the head() method

In [38]:
print(df.head())

   id                                 name  year  rank
0   0                                  #28  2002   NaN
1   1  #7 Train: An Immigrant Journey, The  2000   NaN
2   2                                    $  1971   6.4
3   3                        $1,000 Reward  1913   NaN
4   4                        $1,000 Reward  1915   NaN

To get more information about the dataset, such as column names and data types, use:

In [39]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 388266 entries, 0 to 388265
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   id      388266 non-null  int64
 1   name    388266 non-null  object
 2   year    388266 non-null  int64
 3   rank    67245 non-null   float64
dtypes: float64(1), int64(2), object(1)
memory usage: 11.8+ MB
None

### Basic Data Manipulation
Selecting a single column 'name'

In [40]:
names = df['name']
print(names.head())

0                                    #28
1    #7 Train: An Immigrant Journey, The
2                                      $
3                          $1,000 Reward
4                          $1,000 Reward
Name: name, dtype: object

To select multiple columns:

In [41]:
subset = df[['name', 'year']]
print(subset.head())

                                  name  year
0                                  #28  2002
1  #7 Train: An Immigrant Journey, The  2000
2                                    $  1971
3                        $1,000 Reward  1913
4                        $1,000 Reward  1915

Filtering Data: To filter movies released after 2000:

In [42]:
new_movies = df[df['year'] > 2000]
print(new_movies.head())

    id                   name  year  rank
0    0                    #28  2002   NaN
10  10  $100,000 Pyramid, The  2001   NaN
17  17         $300 y tickets  2002   NaN
21  21              $5.15/Hr.  2004   NaN
31  33                $windle  2002   5.4

Sorting movies by ranking:

In [43]:
sorted_movies = df.sort_values(by='rank', ascending=False)
print(sorted_movies.head())

            id                    name  year  rank
329299  351405          Velnio nuotaka  1973   9.9
121717  131247          Gong fu qi jie  1979   9.9
334771  357173  Voynata na taralezhite  1979   9.9
87842    95123       Duminica la ora 6  1965   9.9
63185    68770   Complex Sessions, The  1994   9.9

### Computing aggregates
The following cell demonstrates how to use aggregate functions and groupBy in Pandas dataframes

In [46]:
# Selecting the 'rank' column for aggregation
# Assuming 'rank' is a numeric column representing the movie's rank

# Calculating the mean rank
mean_rank = df['rank'].mean()
print("\nMean rank of movies:", mean_rank)

# Calculating the median rank
median_rank = df['rank'].median()
print("Median rank of movies:", median_rank)

# Counting the number of movies
movie_count = df['name'].count()
print("Total number of movies:", movie_count)

# Grouping by 'year' and calculating mean rank per year
mean_rank_per_year = df.groupby('year')['rank'].mean()
print("\nMean rank per year:")
print(mean_rank_per_year)

# Grouping by 'year' and getting count of movies per year
movies_per_year = df.groupby('year')['name'].count()
print("\nNumber of movies released per year:")
print(movies_per_year)

# Note: You can replace 'rank' with any other numeric column for similar calculations
# And replace 'year' with any other categorical column for group-wise aggregations

Mean rank of movies: 5.874238976875605
Median rank of movies: 6.0
Total number of movies: 388266

Mean rank per year:
year
1888         NaN
1890    7.300000
1891    3.683333
1892    2.866667
1893    6.800000
          ...
2004    6.217399
2005         NaN
2006         NaN
2007         NaN
2008         NaN
Name: rank, Length: 120, dtype: float64

Number of movies released per year:
year
1888       2
1890       3
1891       6
1892       9
1893       2
        ...
2004    8718
2005    1449
2006     195
2007       7
2008       1
Name: name, Length: 120, dtype: int64

Joining tables
--------

We can do all the flavors of SQL joins with Pandas. In this example, we will use two datasets 'imdb_top_1000.csv' (from https://www.kaggle.com/datasets/harshitshankhdhar/imdb-dataset-of-top-1000-movies-and-tv-shows) containing the top 1000 rated IMDB movies/shows and 'IMDB-movies.csv' containing a list of movies with their ranking. We want to know which movies in IMDB-movies.csv are in the top 1000 movies and find out who the directors of these movies are.

In [54]:
# Importing Pandas
import pandas as pd

# Load the IMDB movies dataset
movies_df = pd.read_csv('IMDB-movies.csv')

# Load the IMDB top 1000 dataset
top_1000_df = pd.read_csv('imdb_top_1000.csv')

# Preprocessing: Ensuring consistent formatting (if necessary)
# For example, strip trailing spaces and convert to a consistent case
movies_df['name'] = movies_df['name'].str.strip().str.lower()
top_1000_df['Series_Title'] = top_1000_df['Series_Title'].str.strip().str.lower()

# Perform the join
# Here we're performing an inner join, which will include only the movies present in both datasets
joined_df = pd.merge(movies_df, top_1000_df, left_on='name', right_on='Series_Title')

# Displaying the first few rows of the joined DataFrame
print(joined_df.head())

# Note:
# - Adjust the type of join (inner, left, right, outer) based on your analysis needs.
# - The preprocessing step is crucial for a successful join and may vary based on your data.

     id                   name  year  rank  \
0   969           12 angry men  1957   8.7
1   970           12 angry men  1997   NaN
2  1374                   1917  1970   6.1
3  1711  2001: a space odyssey  1968   8.3
4  1787               21 grams  2003   8.0

                                         Poster_Link           Series_Title  \
0  https://m.media-amazon.com/images/M/MV5BMWU4N2...           12 angry men
1  https://m.media-amazon.com/images/M/MV5BMWU4N2...           12 angry men
2  https://m.media-amazon.com/images/M/MV5BOTdmNT...                   1917
3  https://m.media-amazon.com/images/M/MV5BMmNlYz...  2001: a space odyssey
4  https://m.media-amazon.com/images/M/MV5BMjA4Mj...               21 grams

  Released_Year Certificate  Runtime                   Genre  IMDB_Rating  \
0          1957           U   96 min            Crime, Drama          9.0
1          1957           U   96 min            Crime, Drama          9.0
2          2019           R  119 min    Drama, Thriller, War          8.3
3          1968           U  149 min       Adventure, Sci-Fi          8.3
4          2003          UA  124 min  Crime, Drama, Thriller          7.6

                                            Overview  Meta_score  \
0  A jury holdout attempts to prevent a miscarria...        96.0
1  A jury holdout attempts to prevent a miscarria...        96.0
2  April 6th, 1917. As a regiment assembles to wa...        78.0
3  After discovering a mysterious artifact buried...        84.0
4  A freak accident brings together a critically ...        70.0

                Director                 Star1             Star2  \
0           Sidney Lumet           Henry Fonda       Lee J. Cobb
1           Sidney Lumet           Henry Fonda       Lee J. Cobb
2             Sam Mendes  Dean-Charles Chapman     George MacKay
3        Stanley Kubrick           Keir Dullea     Gary Lockwood
4  Alejandro G. Iñárritu             Sean Penn  Benicio Del Toro

               Star3           Star4  No_of_Votes        Gross
0      Martin Balsam    John Fiedler       689845    4,360,000
1      Martin Balsam    John Fiedler       689845    4,360,000
2        Daniel Mays     Colin Firth       425844  159,227,644
3  William Sylvester  Daniel Richter       603517   56,954,992
4        Naomi Watts    Danny Huston       224545   16,290,476

Pandas Takeways
--------
Pandas is a great library to deal with smaller datasets (ones that fit in memory). Pandas provides versatile methods to manipulate and query the data. It also allows getting the data directly from a database (https://pandas.pydata.org/docs/reference/api/pandas.read_sql.html). For big datasets, it's prefered to use a database system (like Postgres) and SQL to query the data. For more tutorials on Pandas, please refer to https://github.com/guipsamora/pandas_exercises